ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_usart.c
  USARTx->CR = (USARTx->CR & TRSM_CLEAR_Mask) | USART_SynClock_InitStruct->USART_TransferSelectMode;
}

/*********************************************************************************************************//**
 * @brief Fill each USART_SynClockInitStruct member with its default value.
 * @param USART_SynClock_InitStruct: pointer to a USART_SynClock_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void USART_SynClockStructInit(USART_SynClock_InitTypeDef* USART_SynClock_InitStruct)
{
  /* USART_ClockInitStruct members default value                                                            */
  USART_SynClock_InitStruct->USART_ClockEnable =  USART_SYN_CLOCK_DISABLE;
  USART_SynClock_InitStruct->USART_ClockPhase = USART_SYN_CLOCK_PHASE_FIRST;
  USART_SynClock_InitStruct->USART_ClockPolarity = USART_SYN_CLOCK_POLARITY_LOW;
  USART_SynClock_InitStruct->USART_TransferSelectMode = USART_LSB_FIRST;
}

#if (LIBCFG_USART_LIN)
/*********************************************************************************************************//**
 * @brief USART/UART LIN Mode send break to Tx.
 * @param USARTx: where USARTx is the selected USART/UART from the USART/UART peripherals.
 * @retval None
 ************************************************************************************************************/
void USART_LIN_SendBreak(HT_USART_TypeDef* USARTx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));

  USARTx->CR |= USART_LINSENDBREAK;
}

/*********************************************************************************************************//**
 * @brief Configure the break detection length in LIN mode.
 * @param USARTx: where USARTx is the selected USART/UART from the USART/UART peripherals.
 * @param USART_LIN_Length: data length in byte.
 *   This parameter can be one of the following values:
 *     @arg USART_LINLENGTH_11BIT
 *     @arg USART_LINLENGTH_10BIT
 * @retval None
 ************************************************************************************************************/
void USART_LIN_LengthSelect(HT_USART_TypeDef* USARTx, u32 USART_LIN_Length)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_USART_LINLENGTH(USART_LIN_Length));

  if (USART_LIN_Length != USART_LINLENGTH_10BIT)
  {
    USARTx->CR |= USART_LINLENGTH_11BIT;
  }
  else
  {
    USARTx->CR &= USART_LINLENGTH_10BIT;
  }
}
#endif
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
